Oxmose/ESP32Weather/src/HealthMonitor.cpp
#ifdef HM_TEST_EVENT
/**
 * @brief HM Event hander for HM_EVENT_TEST event.
 *
 * @details HM Event hander for HM_EVENT_TEST event.
 *
 * @param[in] pParam The parameter used when notifying the HM of the event.
 */
void test_hm_event_handler(void* pParam);
#endif

/*******************************************************************************
 * GLOBAL VARIABLES
 ******************************************************************************/

/************************* Imported global variables **************************/
/* None */

/************************* Exported global variables **************************/
/* None */

/************************** Static global variables ***************************/
/** @brief Static handle for the ISR */
static TaskHandle_t sRTTaskHandle;

/** @brief Singleton instance of the health monitor. */
HealthMonitor* HealthMonitor::_SPINSTANCE = nullptr;

/** @brief Stores the HM event handlers. */
static T_EventHandler sHMHandlers[HM_EVENT_MAX] {
    HMAPIServerNoServerHandler,         /* HM_EVENT_API_SERVER_NO_SERVER */
    HMAPIServerLockHandler,             /* HM_EVENT_API_SERVER_LOCK */
    HMWebServerNoServerHandler,         /* HM_EVENT_WEB_SERVER_NO_SERVER */
    HMWebServerLockHandler,             /* HM_EVENT_WEB_SERVER_LOCK */
    HMHWMACNotAvailHandler,             /* HM_EVENT_HW_MAC_NOT_AVAIL */
    HMHWLockHandler,                    /* HM_EVENT_HM_LOCK */
    HMWdTimeoutHandler,                 /* HM_EVENT_WD_TIMEOUT */
    HMRTTaskCreateHandler,              /* HM_EVENT_RT_TASK_CREATE */
    HMRTTaskWait,                       /* HM_EVENT_RT_TASK_WAIT */
    HMRTTaskDeadlineMissHandler,        /* HM_EVENT_RT_TASK_DEADLINE_MISS */
    HMSettingsCreateHandler,            /* HM_EVENT_SETTINGS_CREATE */
    HMSettingsLockHandler,              /* HM_EVENT_SETTINGS_LOCK */
    HMSettingsAccessLoadHandler,        /* HM_EVENT_SETTINGS_LOAD */
    HMSettingsAccessStoreHandler,       /* HM_EVENT_SETTINGS_STORE */
    HMSettingsAccessDefaultHandler,     /* HM_EVENT_SETTINGS_DEFAULT */
    HMWifiCreateHandler,                /* HM_EVENT_WIFI_CREATE */
    HMWebStartHandler,                  /* HM_EVENT_WEB_START */
    HMAddActionHandler,                 /* HM_EVENT_HM_ADD_ACTION */
    HMActionQCreateFailedHandler,       /* HM_EVENT_HM_ACTION_QRECV_FAILED */
    HMActionTaskCreateHandler,          /* HM_EVENT_ACTION_TASK_CREATE */
#ifdef HM_TEST_EVENT
    test_hm_event_handler,              /* HM_EVENT_TEST */
#endif
};

/*******************************************************************************
 * FUNCTIONS
 ******************************************************************************/
static void IRAM_ATTR RealTimeTaskTimerHandler(void) {
    BaseType_t result;
    BaseType_t needSchedule;

    /* Notify the real-time task */
    needSchedule = pdFALSE;
    result = xTaskNotifyFromISR(
        sRTTaskHandle,
        0,
        eNoAction,
        &needSchedule
    );

    if (pdPASS != result) {
        HealthMonitor::GetInstance()->ReportHM(
            E_HMEvent::HM_EVENT_RT_TASK_WAIT,
            (void*)0
        );
    }

    /* Check if scheduling is needed */
    portYIELD_FROM_ISR(needSchedule);
}

static void HMAPIServerNoServerHandler(void* pParam) {
    (void)pParam;
    LOG_ERROR("API Server has no Web Server backend.\n");
    HWManager::Reboot();
}

static void HMAPIServerLockHandler(void* pParam) {
    LOG_ERROR("API Server lock error:\n");
    if ((bool)pParam) {
        LOG_ERROR("\tFailed to lock server.\n");
    }
    else {
        LOG_ERROR("\tFailed to unlock server.\n");
    }
    HWManager::Reboot();
}

static void HMWebServerNoServerHandler(void* pParam) {
    (void)pParam;
    LOG_ERROR("Web Server has no Web Server backend.\n");
    HWManager::Reboot();
}

static void HMWebServerLockHandler(void* pParam) {
    LOG_ERROR("Web Server lock error:\n");
    if ((bool)pParam) {
        LOG_ERROR("\tFailed to lock server.\n");
    }
    else {
        LOG_ERROR("\tFailed to unlock server.\n");
    }
    HWManager::Reboot();
}

static void HMHWMACNotAvailHandler(void* pParam) {
    LOG_ERROR("Error while reading MAC address.\n");
    HWManager::Reboot();
}

static void HMHWLockHandler(void* pParam) {
    LOG_ERROR("HM lock error:\n");
    if ((bool)pParam) {
        LOG_ERROR("\tFailed to lock the HM.\n");
    }
    else {
        LOG_ERROR("\tFailed to unlock the HM.\n");
    }
    HWManager::Reboot();
}

static void HMWdTimeoutHandler(void* pParam) {
    LOG_ERROR(
        "Error while addind or removing a watchdog: error %d.\n",
        (uint32_t)pParam
    );
    HWManager::Reboot();
}

static void HMRTTaskCreateHandler(void* pParam) {
    if (0 == (uint32_t)pParam) {
        LOG_ERROR("Failed to create the RT HM Task timer.\n");
    }
    else if (1 == (uint32_t)pParam) {
        LOG_ERROR("Failed to create the RT HM Task.\n");
    }
    else {
        LOG_ERROR("Unknown RT HM Task error.\n");
    }
    HWManager::Reboot();
}

static void HMRTTaskWait(void* pParam) {
    if (0 == (uint32_t)pParam) {
        LOG_ERROR("Failed to notify the RT HM Task timer.\n");
    }
    else if (1 == (uint32_t)pParam) {
        LOG_ERROR("Failed to wait for the RT HM Task timer.\n");
    }
    else {
        LOG_ERROR("Unknown RT HM Task error.\n");
    }
    HWManager::Reboot();
}

static void HMRTTaskDeadlineMissHandler(void* pParam) {
    LOG_ERROR("RT HM Task deadline miss.\n");
    HWManager::Reboot();
}

static void HMSettingsCreateHandler(void* pParam) {
    LOG_ERROR("Failed to instanciate Settings. Error: %d\n", (uint32_t)pParam);
    HWManager::Reboot();
}

static void HMSettingsLockHandler(void* pParam) {
    LOG_ERROR("Settings lock error:\n");
    if ((bool)pParam) {
        LOG_ERROR("\tFailed to lock the settings.\n");
    }
    else {
        LOG_ERROR("\tFailed to unlock the settings.\n");
    }
    HWManager::Reboot();
}

static void HMSettingsAccessLoadHandler(void* pParam) {
    S_HMParamSettingAccess* pAccessParam;
    E_Return                result;
    Settings*               pSettings;

    pAccessParam = (S_HMParamSettingAccess*)pParam;

