Oxmose/ESP32Weather/src/HealthMonitor.cpp
    LOG_ERROR(
        "Failed to load setting %s. Applying default value.\n",
        pAccessParam->kpSettingName
    );

    /* Propagate the default setting */
    pSettings = Settings::GetInstance();

    result = pSettings->GetDefault(
        pAccessParam->kpSettingName,
        (uint8_t*)pAccessParam->pSettingBuffer,
        pAccessParam->settingBufferSize
    );
    if (E_Return::NO_ERROR != result) {
        HMSettingsAccessDefaultHandler(pParam);
    }

    /* Apply the default setting */
    result = pSettings->SetSettings(
        pAccessParam->kpSettingName,
        (uint8_t*)pAccessParam->pSettingBuffer,
        pAccessParam->settingBufferSize
    );
    if (E_Return::NO_ERROR != result) {
        LOG_ERROR(
            "Failed to set default setting %s.",
            pAccessParam->kpSettingName
        );
        HWManager::Reboot();
    }

    /* Commit */
    result = pSettings->Commit();
    if (E_Return::NO_ERROR != result) {
        LOG_ERROR(
            "Failed to commit default setting %s.",
            pAccessParam->kpSettingName
        );
        HWManager::Reboot();
    }
}

static void HMSettingsAccessStoreHandler(void* pParam) {
    S_HMParamSettingAccess* pAccessParam;

    pAccessParam = (S_HMParamSettingAccess*)pParam;

    LOG_ERROR(
        "Failed to set value for setting %s.\n",
        pAccessParam->kpSettingName
    );

    HWManager::Reboot();
}

static void HMSettingsAccessDefaultHandler(void* pParam) {
    S_HMParamSettingAccess* pAccessParam;

    pAccessParam = (S_HMParamSettingAccess*)pParam;

    LOG_ERROR(
        "Failed to get default value for setting %s.\n",
        pAccessParam->kpSettingName
    );
    HWManager::Reboot();
}

static void HMWifiCreateHandler(void* pParam) {
    if (0 == (uint32_t)pParam) {
        LOG_ERROR("Failed to instanciate the WiFi module.\n");
    }
    else {
        LOG_ERROR(
            "Failed to create the Web Servers, error: %d\n",
            (uint32_t)pParam
        );
    }
    HWManager::Reboot();
}

static void HMWebStartHandler(void* pParam) {
    LOG_ERROR(
        "Failed to start the Web Servers, error: %d\n",
        (uint32_t)pParam
    );
    HWManager::Reboot();
}

static void HMAddActionHandler(void* pParam) {
    LOG_ERROR(
        "Failed to add HM action, error: %d\n",
        (uint32_t)pParam
    );
    HWManager::Reboot();
}

static void HMActionQCreateFailedHandler(void* pParam) {
    LOG_ERROR(
        "Failed create HM action queue, error: %d\n",
        (uint32_t)pParam
    );
    HWManager::Reboot();
}

static void HMActionTaskCreateHandler(void* pParam) {
    if (0 == (uint32_t)pParam) {
        LOG_ERROR("Failed to create the HM action queue.\n");
    }
    else {
        LOG_ERROR(
            "Failed to create the HM action task, error: %d\n",
            (uint32_t)pParam
        );
    }
    HWManager::Reboot();
}

/*******************************************************************************
 * CLASS METHODS
 ******************************************************************************/

HealthMonitor* HealthMonitor::GetInstance(void) noexcept {
    if (nullptr == HealthMonitor::_SPINSTANCE) {
        HealthMonitor::_SPINSTANCE = new HealthMonitor();

        if (nullptr == HealthMonitor::_SPINSTANCE) {
            LOG_ERROR("Failed to insanciate the Health Monitor.\n");
            HWManager::Reboot();
        }
    }

    return HealthMonitor::_SPINSTANCE;
}

void HealthMonitor::Init(void) noexcept {
    /* Initialize the HM tasks */
    RealTimeTaskInit();
    ActionsTaskInit();
}

E_Return HealthMonitor::AddWatchdog(Timeout* pTimeout, uint32_t& rId) noexcept {
    E_Return error;

    /* Check settings */
    if (0 != pTimeout->GetNextWatchdogEvent()) {
        if (pdPASS == xSemaphoreTake(this->_wdLock, WD_LOCK_TIMEOUT_TICKS)) {
            if (this->_lastWDId < UINT32_MAX) {
                try {
                    this->_watchdogs.emplace(
                        std::make_pair(this->_lastWDId, pTimeout)
                    );
                    rId = this->_lastWDId++;
                    error = E_Return::NO_ERROR;
                }
                catch (std::exception& rExc) {
                    error = E_Return::ERR_UNKNOWN;
                }
            }
            else {
                error = E_Return::ERR_MEMORY;
            }

            if (pdPASS != xSemaphoreGive(this->_wdLock)) {
                HealthMonitor::GetInstance()->ReportHM(
                    E_HMEvent::HM_EVENT_HM_LOCK,
                    (void*)1
                );
            }
        }
        else {
            LOG_ERROR("Failed to acquire watchdogs lock.\n");
            error = E_Return::ERR_HM_TIMEOUT;
        }
    }
    else {
        error = E_Return::ERR_INVALID_PARAM;
    }


    return error;
}

E_Return HealthMonitor::RemoveWatchdog(const uint32_t kId) noexcept {
    E_Return                                         error;
    std::unordered_map<uint32_t, Timeout*>::iterator it;

    if (pdPASS == xSemaphoreTake(this->_wdLock, WD_LOCK_TIMEOUT_TICKS)) {
        it = this->_watchdogs.find(kId);
        if (this->_watchdogs.end() != it) {
            try {
                this->_watchdogs.erase(it);
                error = E_Return::NO_ERROR;
            }
            catch (std::exception& rExc) {
                error = E_Return::ERR_UNKNOWN;
            }
        }
        else {
            error = E_Return::ERR_NO_SUCH_ID;
        }

        if (pdPASS != xSemaphoreGive(this->_wdLock)) {
            HealthMonitor::GetInstance()->ReportHM(
                E_HMEvent::HM_EVENT_HM_LOCK,
                (void*)1
            );
        }
    }
    else {
        LOG_ERROR("Failed to acquire watchdogs lock.\n");
        error = E_Return::ERR_HM_TIMEOUT;
    }

    return error;
}

void HealthMonitor::SetSystemState(const E_SystemState kState) noexcept {
    this->_systemState = kState;
}


E_Return HealthMonitor::AddReporter(HMReporter* pReporter,
                                    uint32_t&   rId) noexcept {
    E_Return error;

    /* Check settings */
    if (pdPASS == xSemaphoreTake(this->_reportersLock, WD_LOCK_TIMEOUT_TICKS)) {
        if (this->_lastReporterId < UINT32_MAX) {
            try {
                this->_reporters.emplace(
                    std::make_pair(this->_lastReporterId, pReporter)
                );
                rId = this->_lastReporterId++;
                error = E_Return::NO_ERROR;
            }
            catch (std::exception& rExc) {
                error = E_Return::ERR_UNKNOWN;
            }
        }
        else {
            error = E_Return::ERR_MEMORY;
        }

