Oxmose/ESP32Weather/src/HealthMonitor.cpp
        if (pdPASS != xSemaphoreGive(this->_reportersLock)) {
            HealthMonitor::GetInstance()->ReportHM(
                E_HMEvent::HM_EVENT_HM_LOCK,
                (void*)1
            );
        }
    }
    else {
        LOG_ERROR("Failed to acquire reporters lock.\n");
        error = E_Return::ERR_HM_TIMEOUT;
    }

    return error;
}

E_Return HealthMonitor::RemoveReporter(const uint32_t kId) noexcept {
    E_Return                                            error;
    std::unordered_map<uint32_t, HMReporter*>::iterator it;

    if (pdPASS == xSemaphoreTake(this->_reportersLock, WD_LOCK_TIMEOUT_TICKS)) {
        it = this->_reporters.find(kId);
        if (this->_reporters.end() != it) {
            try {
                this->_reporters.erase(it);
                error = E_Return::NO_ERROR;
            }
            catch (std::exception& rExc) {
                error = E_Return::ERR_UNKNOWN;
            }
        }
        else {
            error = E_Return::ERR_NO_SUCH_ID;
        }

        if (pdPASS != xSemaphoreGive(this->_reportersLock)) {
            HealthMonitor::GetInstance()->ReportHM(
                E_HMEvent::HM_EVENT_HM_LOCK,
                (void*)1
            );
        }
    }
    else {
        LOG_ERROR("Failed to acquire reporters lock.\n");
        error = E_Return::ERR_HM_TIMEOUT;
    }

    return error;
}

E_Return HealthMonitor::AddHMAction(HMReporter* pReporter) noexcept {
    BaseType_t result;
    E_Return   retVal;

    /* Place the action in the actions queue */
    result = xQueueSend(this->_actionsQueue, (void*)&pReporter, 0);
    if (pdPASS != result) {
        /* We should never have too many actions */
        retVal = E_Return::ERR_HM_FULL;
    }
    else {
        retVal = E_Return::NO_ERROR;
    }

    return retVal;
}

void HealthMonitor::ReportHM(const E_HMEvent kEvent,
                             void*           pParam /* = nullptr */) const
noexcept {
    if (HM_EVENT_MAX > kEvent) {
        /* Execute the registered handler */
        sHMHandlers[kEvent](pParam);
    }
    else {
        LOG_ERROR("HM Event unknown: %d.\n", kEvent);
        HWManager::Reboot();
    }
}

HealthMonitor::HealthMonitor(void) noexcept {
    this->_lastWDId = 0;
    this->_lastReporterId = 0;
    this->_systemState = E_SystemState::STARTING;

    this->_wdLock = xSemaphoreCreateMutex();
    if (nullptr == this->_wdLock) {
        LOG_ERROR("Failed to initialize Health Monitor Watchdogs lock.\n");
        HWManager::Reboot();
    }
    this->_reportersLock = xSemaphoreCreateMutex();
    if (nullptr == this->_reportersLock) {
        LOG_ERROR("Failed to initialize Health Monitor Reporters lock.\n");
        HWManager::Reboot();
    }
}

void HealthMonitor::RealTimeTaskRoutine(void* pHealthMonitor) noexcept {
    BaseType_t     result;
    HealthMonitor* pHM;
    Timeout        hmDeadlineTimeout(HW_RT_TASK_DEADLINE_MISS_DELAY);

    pHM = (HealthMonitor*)pHealthMonitor;

    while (true) {
        /* Wait for trigger signal */
        result = xTaskNotifyWait(0xFFFFFFFFUL, 0x0UL, 0x0UL, portMAX_DELAY);
        if (pdPASS != result) {
            HealthMonitor::GetInstance()->ReportHM(
                E_HMEvent::HM_EVENT_RT_TASK_WAIT,
                (void*)1
            );
        }

        /* Check for deadline miss */
        if (E_SystemState::EXECUTING == pHM->_systemState &&
            hmDeadlineTimeout.Check()) {
            HealthMonitor::GetInstance()->ReportHM(
                E_HMEvent::HM_EVENT_RT_TASK_DEADLINE_MISS
            );
        }

        /* Tick the timeout */
        hmDeadlineTimeout.Tick();

        /* Perform HM checks */
        pHM->CheckWatchdogs();
        pHM->CheckReporters();
    }
}

void HealthMonitor::HMActionTaskRoutine(void* pHealthMonitor) noexcept {
    HealthMonitor* pHM;
    HMReporter*    pReporter;
    BaseType_t     result;

    pHM = (HealthMonitor*)pHealthMonitor;

    while (true) {
        /* Get the next job */
        result = xQueueReceive(
            pHM->_actionsQueue,
            (void*)&pReporter,
            portMAX_DELAY
        );

        if (pdPASS != result) {
            HealthMonitor::GetInstance()->ReportHM(
                E_HMEvent::HM_EVENT_HM_ACTION_QRECV_FAILED,
                (void*)result
            );
        }

        /* Execute the action */
        pReporter->ExecuteAction();
    }
}

void HealthMonitor::CheckWatchdogs(void) const noexcept {
    uint64_t                                               currentTime;
    std::unordered_map<uint32_t, Timeout*>::const_iterator it;

    /* Check for watchdogs */
    currentTime = HWManager::GetTime();
    if (pdPASS == xSemaphoreTake(this->_wdLock, WD_LOCK_TIMEOUT_TICKS)) {
        for (it = this->_watchdogs.begin();
             this->_watchdogs.end() != it;
             ++it) {
            /* Check for dealine miss */
            if (it->second->GetNextWatchdogEvent() < currentTime) {
                it->second->ExecuteHandler();
            }
        }

        if (pdPASS != xSemaphoreGive(this->_wdLock)) {
            HealthMonitor::GetInstance()->ReportHM(
                E_HMEvent::HM_EVENT_HM_LOCK,
                (void*)1
            );
        }
    }
    else {
        HealthMonitor::GetInstance()->ReportHM(
            E_HMEvent::HM_EVENT_HM_LOCK,
            (void*)0
        );
    }
}

void HealthMonitor::CheckReporters(void) const noexcept {
    uint64_t                                                  currentTime;
    std::unordered_map<uint32_t, HMReporter*>::const_iterator it;

    /* Check for HM reporters */
    currentTime = HWManager::GetTime();
    if (pdPASS == xSemaphoreTake(this->_reportersLock, WD_LOCK_TIMEOUT_TICKS)) {
        for (it = this->_reporters.begin();
             this->_reporters.end() != it;
             ++it) {
            it->second->HealthCheck(currentTime);
        }

        if (pdPASS != xSemaphoreGive(this->_reportersLock)) {
            HealthMonitor::GetInstance()->ReportHM(
                E_HMEvent::HM_EVENT_HM_LOCK,
                (void*)1
            );
        }
    }
    else {
        HealthMonitor::GetInstance()->ReportHM(
            E_HMEvent::HM_EVENT_HM_LOCK,
            (void*)0
        );
    }
}

void HealthMonitor::RealTimeTaskInit(void) noexcept {
    BaseType_t result;

    /* Start the real time task timer */
    this->_RTTaskTimer = timerBegin(
        HW_RT_TASK_TIMER,
        HW_RT_TASK_TIMER_PRESCALER,
        true
    );
    if (nullptr == this->_RTTaskTimer) {
        HealthMonitor::GetInstance()->ReportHM(
            E_HMEvent::HM_EVENT_RT_TASK_CREATE,
            (void*)0
        );
    }
    timerAttachInterrupt(this->_RTTaskTimer, RealTimeTaskTimerHandler, true);
    timerAlarmWrite(this->_RTTaskTimer, HW_RT_TASK_TIMER_DEC_INT, true);
    timerAlarmEnable(this->_RTTaskTimer);


    /* Create the real-time high-priority task */
    result = xTaskCreatePinnedToCore(
        RealTimeTaskRoutine,
        HW_RT_TASK_NAME,
        HW_RT_TASK_STACK,
        this,
        HW_RT_TASK_PRIO,
        &this->_RTTaskHandle,
        HW_RT_TASK_CORE
    );
    if (pdPASS != result) {
        HealthMonitor::GetInstance()->ReportHM(
            E_HMEvent::HM_EVENT_RT_TASK_CREATE,
            (void*)1
        );
    }

    sRTTaskHandle = this->_RTTaskHandle;
}

void HealthMonitor::ActionsTaskInit(void) noexcept {
    BaseType_t result;

    /* Create the actions queue */
    this->_actionsQueue = xQueueCreate(
        HM_ACTIONS_TASK_QUEUE_LENGTH,
        sizeof(HMReporter*)
    );
    if (nullptr == this->_actionsQueue) {
        HealthMonitor::GetInstance()->ReportHM(
            E_HMEvent::HM_EVENT_ACTION_TASK_CREATE,
            (void*)0
        );
    }

    /* Create the real-time high-priority task */
    result = xTaskCreatePinnedToCore(
        HMActionTaskRoutine,
        HM_ACTIONS_TASK_NAME,
        HM_ACTIONS_TASK_STACK,
        this,
        HM_ACTIONS_TASK_PRIO,
        &this->_actionsTaskHandle,
        HM_ACTIONS_TASK_CORE
    );
    if (pdPASS != result) {
        HealthMonitor::GetInstance()->ReportHM(
            E_HMEvent::HM_EVENT_ACTION_TASK_CREATE,
            (void*)1
        );
    }
}